{
  "name": "code-reviewer",
  "description": "Use this agent when you need to review code for adherence to project guidelines, style guides, and best practices. This agent should be used proactively after writing or modifying code, especially before committing changes or creating pull requests. It will check for style violations, potential issues, and ensure code follows the established patterns in project guidelines (e.g., .github/copilot-instructions.md). Also the agent needs to know which files to focus on for the review. In most cases this will recently completed work which is unstaged in git (can be retrieved by doing a git diff). However there can be cases where this is different, make sure to specify this as the agent input when calling the agent. \\n\\nExamples:\\n<example>\\nContext: The user has just implemented a new feature with several TypeScript files.\\nuser: \"I've added the new authentication feature. Can you check if everything looks good?\"\\nassistant: \"I'll use the Task tool to launch the code-reviewer agent to review your recent changes.\"\\n<commentary>\\nSince the user has completed a feature and wants validation, use the code-reviewer agent to ensure the code meets project standards.\\n</commentary>\\n</example>\\n<example>\\nContext: The assistant has just written a new utility function.\\nuser: \"Please create a function to validate email addresses\"\\nassistant: \"Here's the email validation function:\"\\n<function call omitted for brevity>\\nassistant: \"Now I'll use the Task tool to launch the code-reviewer agent to review this implementation.\"\\n<commentary>\\nProactively use the code-reviewer agent after writing new code to catch issues early.\\n</commentary>\\n</example>\\n<example>\\nContext: The user is about to create a PR.\\nuser: \"I think I'm ready to create a PR for this feature\"\\nassistant: \"Before creating the PR, I'll use the Task tool to launch the code-reviewer agent to ensure all code meets our standards.\"\\n<commentary>\\nProactively review code before PR creation to avoid review comments and iterations.\\n</commentary>\\n</example>",
  "category": "tools",
  "canonical_category": "tools",
  "repository": "ngx-signal-forms/ngx-signal-forms",
  "repository_url": "https://github.com/ngx-signal-forms/ngx-signal-forms",
  "author": "ngx-signal-forms",
  "author_avatar": "https://github.com/ngx-signal-forms.png",
  "file_path": ".github/skills/pr-toolkit/code-reviewer/SKILL.md",
  "source": "github_code_search",
  "stars": 0,
  "quality_score": 45,
  "best_practices_score": 50,
  "skill_level": 2,
  "skill_level_label": "instructions",
  "has_scripts": false,
  "has_extra_files": false,
  "downloads": 0,
  "content_hash": "cfca10127f932a68ed1c5cad1fc3a6726a3165835f37398f1b743a86adfe650b",
  "indexed_at": "2026-02-26T18:38:52.408Z",
  "synced_at": "2026-02-28T04:16:21.289Z",
  "omni_registry_url": "https://omni-skill-registry.omniroute.online/#/skill/457d0592a615c42283a79761b745df3ffcaa378dff0f171c8b1902795ac18758",
  "install_command": "mkdir -p .claude/skills/code-reviewer && curl -sL \"https://raw.githubusercontent.com/ngx-signal-forms/ngx-signal-forms/main/.github/skills/pr-toolkit/code-reviewer/SKILL.md\" > .claude/skills/code-reviewer/SKILL.md",
  "raw_url": "https://raw.githubusercontent.com/ngx-signal-forms/ngx-signal-forms/main/.github/skills/pr-toolkit/code-reviewer/SKILL.md"
}
